
#Вычислить число Пи c заданной точностью d
#Пример:
#при d = 0.001, π = 3.141
#при d = 0.1, π = 3.1
#при d = 0.00001, π = 3.14154
#d от 0.1 до 0.0000000001

#!!! не округлять константу math
# Вычислить число Пи c заданной точностью d
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

# !!ВНИМАНИЕ

# !!! не использовать константу math.pi

import math
from math import pi

n = pi
print(n)

# Формула Бэйли — Боруэйна — Плаффа

k = input('Введите точность измерения : ')

l = len(k)
my_pi = sum(1/16**x*(4/(8*x + 1) - 2/(8*x + 4) - 1/(8*x + 5) - 1/(8*x + 6)) for x in range(l))

e = (str(my_pi))
for i in range(l):
    print(e[i], end = '')
print()

print(my_pi)
